DataProcessors/БизнесПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>БизнесПриложения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПодключениеКомбинированныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПодключениеКомбинированныхПриложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКомбинированногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусКомбинированногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусКомбинированногоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/БизнесПриложения/Forms/ВыборДемоПриложений/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПростыеРеквизиты();
	ЗаполнитьТЗПриложения();
	
	СоздатьПриложенияНаФорме();
	ОбновитьОтображениеВыбранныхПриложений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ЗавершитьРаботуНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ПолеВыбораПриложенияПриИзменении(Элемент)
	
	ВыбратьПриложение(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияКартинкаПриложенияНажатие(Элемент)
	
	ВыбратьПриложение(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнтерфейса

&НаСервере
Процедура ОбновитьОтображениеВыбранныхПриложений()
	
	ОписаниеПриложений = ОписаниеВсехБизнесПриложений();
	
	ОбновитьДоступностьВыбораПодчиненныхПриложений(ОписаниеПриложений);
	ОбновитьОтображениеСпискаВыбранныхПриложений(ОписаниеПриложений);
	ОбновитьОтображениеДополнительныхЭлементовПоКоличествуВП();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьВыбораПодчиненныхПриложений(ОписаниеПриложений)
	
	Для Каждого Приложение Из Приложения Цикл
		
		Если Не Приложение.Выбрано Тогда
			ДоступенВыборПриложения = Истина;
		ИначеЕсли Не Приложение.ВыбраноВручную Тогда
			ДоступенВыборПриложения = Ложь;
		Иначе
			ДоступенВыборПриложения = Не РодительскоеПриложениеВыбрано(Приложение, ОписаниеПриложений);
		КонецЕсли;
		
		Имя = Приложение.Имя;
		
		Элементы[НаименованиеДекорацииНазванияПриложения(Имя)].Доступность = ДоступенВыборПриложения;
		Элементы[НаименованиеПоляВыбораПриложения(Имя)].Доступность = ДоступенВыборПриложения;
		Элементы[НаименованиеДекорацииОписанияПриложения(Имя)].Доступность = ДоступенВыборПриложения;
		Элементы[НаименованиеДекорацииКартинкиПриложения(Имя)].Гиперссылка = ДоступенВыборПриложения;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСпискаВыбранныхПриложений(ОписаниеПриложений)
	
	ЕстьВыбранныеПриложения = Ложь;
	ЕстьПодчиненныеПриложения = Ложь;
	
	Для Каждого Приложение Из Приложения Цикл
		
		Если Не Приложение.Выбрано Тогда
			УдалитьВыбранноеПриложениеСФормы(Приложение);
			Продолжить;
		КонецЕсли;
		
		Если Не Приложение.ВыбраноВручную Тогда
			ВыбраноПодчиненноеПриложение = Истина;
		Иначе
			ВыбраноПодчиненноеПриложение = РодительскоеПриложениеВыбрано(Приложение, ОписаниеПриложений);
		КонецЕсли;
		
		ДобавитьВыбранноеПриложениеНаФорму(Приложение, ВыбраноПодчиненноеПриложение);
		
		Если Не ЕстьВыбранныеПриложения Тогда
			ЕстьВыбранныеПриложения = Истина;
		КонецЕсли;
		Если ВыбраноПодчиненноеПриложение И Не ЕстьПодчиненныеПриложения Тогда
			ЕстьПодчиненныеПриложения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ВыбранныеПриложенияКонтейнер.Видимость = ЕстьВыбранныеПриложения;
	Элементы.ВПНичегоНеВыбрано.Видимость = Не ЕстьВыбранныеПриложения;
	Элементы.АвтоматическиВыбранныеПриложения.Видимость = ЕстьПодчиненныеПриложения;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеДополнительныхЭлементовПоКоличествуВП()
	
	КоличествоВыбранныхПриложений = ВыбранныеПриложения().Количество();
	ЕстьВыбранныеПриложения = (КоличествоВыбранныхПриложений <> 0);
	
	Элементы.ВПКоличество.Заголовок = КоличествоВыбранныхПриложений;
	Элементы.КомандаПродолжить.Доступность = ЕстьВыбранныеПриложения;
	
КонецПроцедуры

#КонецОбласти

#Область ДанныеПриложений

&НаСервере
Функция ДанныеПриложений()
	
	Результат = Новый Массив;
	ОписанияВсехПриложений = ОписаниеВсехБизнесПриложений();
	СтатусыПриложений = РегистрыСведений.ПодключениеКомбинированныхПриложений.СтатусПриложений();
	
	Для Каждого ОписаниеПриложения Из ОписанияВсехПриложений Цикл
		
		ДанныеПриложения = ДанныеПриложенияПоИмени(
		ОписаниеПриложения.Имя, ОписанияВсехПриложений, СтатусыПриложений);
		Если ДанныеПриложения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеПриложения.Порядок <= Результат.ВГраница() Тогда
			Результат[ДанныеПриложения.Порядок] = ДанныеПриложения;
		Иначе
			Результат.Вставить(ДанныеПриложения.Порядок, ДанныеПриложения);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьВыбранностьПодчиненныхПриложений(Результат, ОписанияВсехПриложений);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеПриложенияПоИмени(Имя, ОписанияВсехПриложений, СтатусыПриложений)
	
	ОписаниеПриложения = ОписаниеПриложенияПоИмени(Имя, ОписанияВсехПриложений);
	Если ОписаниеПриложения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДополнительныеДанные = ТарификацияБизнесКлиентСервер.ДополнительныеДанныеПриложения(Имя);
	Если ДополнительныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПриложениеПодключено = ПриложениеПодключено(Имя, СтатусыПриложений);
	
	Результат = Новый Структура;
	Результат.Вставить("Синоним", ОписаниеПриложения.Синоним);
	Результат.Вставить("МодульПриложения", ОписаниеПриложения.МодульПриложения);
	Результат.Вставить("ЗамещаетПриложения", ОписаниеПриложения.ЗамещаетПриложения);
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("Выбрано", ПриложениеПодключено);
	Результат.Вставить("ВыбраноВручную", ПриложениеПодключено);
	Результат.Вставить("Описание", ДополнительныеДанные.Описание);
	Результат.Вставить("Картинка", ДополнительныеДанные.Картинка);
	Результат.Вставить("ИмяКатегории", ДополнительныеДанные.ИмяКатегории);
	Результат.Вставить("Порядок", ДополнительныеДанные.Порядок);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОписаниеПриложенияПоИмени(Имя, ОписанияВсехПриложений)
	
	Для Каждого Описание Из ОписанияВсехПриложений Цикл
		Если Имя = Описание.Имя Тогда
			Возврат Описание;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПриложениеПодключено(Имя, СтатусыПриложений)
	
	Результат = Неопределено;
	
	Для Каждого СтатусПриложения Из СтатусыПриложений Цикл
		Если СтатусПриложения.ИмяПриложения = Имя Тогда
			Результат = СтатусПриложения.Статус;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат (Результат = Перечисления.СтатусКомбинированногоПриложения.Подключено);
	
КонецФункции

&НаСервере
Процедура УстановитьВыбранностьПодчиненныхПриложений(ДанныеПриложений, ОписаниеПриложений)
	
	ПриложенияНаПодключение = Новый Массив;
	Для Каждого ДанныеПриложения Из ДанныеПриложений Цикл
		
		Если Не ДанныеПриложения.Выбрано Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПриложенияНаПодключение, ДанныеПриложения.ЗамещаетПриложения, Истина);
		
	КонецЦикла;
	
	Для Каждого ИмяПриложения Из ПриложенияНаПодключение Цикл
		Для Каждого ДанныеПриложения Из ДанныеПриложений Цикл
			
			Если ДанныеПриложения.Имя = ИмяПриложения Тогда
				ДанныеПриложения.Выбрано = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеКатегорийСПриложениями()
	
	Результат = Новый Массив;
	
	ИменаКатегорий = ТарификацияБизнесКлиентСервер.ИменаКатегорий();
	
	Для Каждого Имя Из ИменаКатегорий Цикл
		
		ДанныеКатегории = ДанныеКатегорииСПриложениямиПоИмени(Имя);
		Если ДанныеКатегории = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеКатегории.Порядок <= Результат.ВГраница() Тогда
			Результат[ДанныеКатегории.Порядок] = ДанныеКатегории;
		Иначе
			Результат.Вставить(ДанныеКатегории.Порядок, ДанныеКатегории);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ДанныеКатегорииСПриложениямиПоИмени(ИмяКатегории)
	
	Результат = ТарификацияБизнесКлиентСервер.ДанныеКатегории(ИмяКатегории);
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("Приложения", Новый Массив);
	Для Каждого Приложение Из Приложения Цикл
		Если Приложение.ИмяКатегории = ИмяКатегории Тогда
			Результат.Приложения.Добавить(Приложение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыбранныеПриложения()
	
	Возврат Приложения.НайтиСтроки(Новый Структура("Выбрано", Истина));
	
КонецФункции

&НаСервере
Функция ПодчиненныеПриложения(ИмяПриложения, ОписаниеПриложений)
	
	Для Каждого Описание Из ОписаниеПриложений Цикл
		Если Описание.Имя = ИмяПриложения Тогда
			
			Результат = Новый Массив;
			Для Каждого ИмяПодчиненногоПриложения Из Описание.ЗамещаетПриложения Цикл
				Результат.Добавить(ПриложениеПоИмени(ИмяПодчиненногоПриложения));
			КонецЦикла;
			
			Возврат Результат;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервере
Функция РодительскоеПриложениеВыбрано(ПодчиненноеПриложение, ОписаниеПриложений)
	
	Для Каждого ОписаниеПриложения Из ОписаниеПриложений Цикл
		Для Каждого Имя Из ОписаниеПриложения.ЗамещаетПриложения Цикл
			
			Если ПодчиненноеПриложение.Имя <> Имя Тогда
				Продолжить;
			КонецЕсли;
			
			РодительскоеПриложение = ПриложениеПоИмени(ОписаниеПриложения.Имя);
			Если РодительскоеПриложение.Выбрано Тогда
				Возврат Истина;
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ДругоеРодительскоеПриложениеВыбрано(ПодчиненноеПриложение, РодительскоеПриложение, ОписаниеПриложений)
	
	Для Каждого ОписаниеПриложения Из ОписаниеПриложений Цикл
		
		Если ОписаниеПриложения.Имя = РодительскоеПриложение.Имя Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Имя Из ОписаниеПриложения.ЗамещаетПриложения Цикл
			
			Если ПодчиненноеПриложение.Имя <> Имя Тогда
				Продолжить;
			КонецЕсли;
			
			ДругоеРодительскоеПриложение = ПриложениеПоИмени(ОписаниеПриложения.Имя);
			Если ДругоеРодительскоеПриложение.Выбрано Тогда
				Возврат Истина;
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЗПриложения()
	
	Приложения.Очистить();
	
	ДанныеПриложений = ДанныеПриложений();
	Для Каждого ДанныеПриложения Из ДанныеПриложений Цикл
		ЗаполнитьЗначенияСвойств(Приложения.Добавить(), ДанныеПриложения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПриложениеПоИмени(Имя)
	
	Возврат Приложения.НайтиСтроки(Новый Структура("Имя", Имя))[0];
	
КонецФункции

&НаСервере
Функция ОписаниеВсехБизнесПриложений()
	
	ОписанияПриложений = ТарификацияБизнес.ОписаниеВсехПриложений();
	
	КоличествоОписаний = ОписанияПриложений.Количество();
	Для Индекс = 1 По КоличествоОписаний Цикл
		
		ОбратныйИндекс = КоличествоОписаний - Индекс;
		Если Не ОписанияПриложений[ОбратныйИндекс].ЭтоБизнесПриложение Тогда
			ОписанияПриложений.Удалить(ОбратныйИндекс);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписанияПриложений;
	
КонецФункции

#КонецОбласти

#Область СозданиеПриложенийНаФорме

#Область ПереиспользуемыеНаименованияЭлементов

&НаСервере
Функция НаименованиеГруппыВыбранногоПриложения(ИмяПриложения)
	
	Возврат СтрШаблон("ГруппаВыбранногоПриложения_%1", ИмяПриложения);
	
КонецФункции

&НаСервере
Функция НаименованиеДекорацииНазванияПриложения(ИмяПриложения)
	
	Возврат СтрШаблон("ДекорацияНазваниеПриложения_%1", ИмяПриложения);
	
КонецФункции

&НаСервере
Функция НаименованиеПоляВыбораПриложения(ИмяПриложения)
	
	Возврат СтрШаблон("ПолеВыбораПриложения_%1", ИмяПриложения);
	
КонецФункции

&НаСервере
Функция НаименованиеДекорацииОписанияПриложения(ИмяПриложения)
	
	Возврат СтрШаблон("ДекорацияОписаниеПриложения_%1", ИмяПриложения);
	
КонецФункции

&НаСервере
Функция НаименованиеДекорацииКартинкиПриложения(ИмяПриложения)
	
	Возврат СтрШаблон("ДекорацияКартинкаПриложения_%1", ИмяПриложения);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура СоздатьПриложенияНаФорме()
	
	ГруппаКонтейнер = Элементы.Приложения;
	
	ШрифтДекорации = Новый Шрифт(, 16);
	ШрифтНазванияПриложения = Новый Шрифт(, 12);
	ШрифтМаленькойДекорации = Новый Шрифт(, 1);
	
	ПараметрыСозданияПриложения = Новый Структура;
	ПараметрыСозданияПриложения.Вставить("ШрифтНазвания", ШрифтНазванияПриложения);
	ПараметрыСозданияПриложения.Вставить("ШрифтКнопки", ШрифтНазванияПриложения);
	ПараметрыСозданияПриложения.Вставить("ШрифтМаленькойДекорации", ШрифтМаленькойДекорации);
	ПараметрыСозданияПриложения.Вставить("Высота", 9);
	ПараметрыСозданияПриложения.Вставить("ШиринаКонтента", 26);
	ПараметрыСозданияПриложения.Вставить("ШиринаНазвания", 18);
	
	ПараметрыСозданияПриложения.Вставить("КартинкаЛинияВерх", БиблиотекаКартинок.ПульсБизнесаПоказательВерх);
	ПараметрыСозданияПриложения.Вставить("КартинкаЛинияПраво", БиблиотекаКартинок.ПульсБизнесаПоказательПраво);
	ПараметрыСозданияПриложения.Вставить("КартинкаЛинияНиз", БиблиотекаКартинок.ПульсБизнесаПоказательНиз);
	ПараметрыСозданияПриложения.Вставить("КартинкаЛинияЛево", БиблиотекаКартинок.ПульсБизнесаПоказательЛево);
	ПараметрыСозданияПриложения.Вставить(
	"КартинкаЛевыйВерхнийУгол", БиблиотекаКартинок.ПульсБизнесаПоказательЛевыйВерхнийУгол);
	ПараметрыСозданияПриложения.Вставить(
	"КартинкаПравыйВерхнийУгол", БиблиотекаКартинок.ПульсБизнесаПоказательПравыйВерхнийУгол);
	ПараметрыСозданияПриложения.Вставить(
	"КартинкаЛевыйНижнийУгол", БиблиотекаКартинок.ПульсБизнесаПоказательЛевыйНижнийУгол);
	ПараметрыСозданияПриложения.Вставить(
	"КартинкаПравыйНижнийУгол", БиблиотекаКартинок.ПульсБизнесаПоказательПравыйНижнийУгол);
	
	ДанныеКатегорийСПриложениями = ДанныеКатегорийСПриложениями();
	Для Каждого ДанныеКатегории Из ДанныеКатегорийСПриложениями Цикл
		
		ИмяКатегории = ДанныеКатегории.Имя;
		
		СписокПриложений = ДанныеКатегории.Приложения;
		КоличествоПриложений = СписокПриложений.Количество();
		Если КоличествоПриложений = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппаКатегорииИПриложений = Элементы.Добавить(
		СтрШаблон("ГруппаКатегорииИПриложений_%1", ИмяКатегории), Тип("ГруппаФормы"), ГруппаКонтейнер);
		ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаКатегорииИПриложений);
		ГруппаКатегорииИПриложений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаКатегорииИПриложений.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		ГруппаКатегорииИПриложений.РастягиватьПоВертикали = Ложь;
		
		ГруппаКатегории = Элементы.Добавить(
		СтрШаблон("ГруппаКатегории_%1", ИмяКатегории), Тип("ГруппаФормы"), ГруппаКатегорииИПриложений);
		ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаКатегории);
		ГруппаКатегории.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ДекорацияОтступаКатегории = Элементы.Добавить(
		СтрШаблон("ДекорацияОтступаКатегории_%1", ИмяКатегории), Тип("ДекорацияФормы"), ГруппаКатегории);
		ДекорацияОтступаКатегории.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияОтступаКатегории.Шрифт = ШрифтМаленькойДекорации;
		ДекорацияОтступаКатегории.Ширина = 1;
		
		ДекорацияКатегории = Элементы.Добавить(
		СтрШаблон("ДекорацияКатегории_%1", ИмяКатегории), Тип("ДекорацияФормы"), ГруппаКатегории);
		ДекорацияКатегории.Вид = ВидДекорацииФормы.Надпись;
		ДекорацияКатегории.Заголовок = ДанныеКатегории.Синоним;
		ДекорацияКатегории.Шрифт = ШрифтДекорации;
		
		ГруппаОберткиПриложенийКатегории = Неопределено;
		Для ИндексПриложения = 0 По КоличествоПриложений - 1 Цикл
			
			Приложение = СписокПриложений[ИндексПриложения];
			
			Если ИндексПриложения % 3 = 0 Тогда
				
				ГруппаОберткиПриложенийКатегории = Элементы.Добавить(
				СтрШаблон("ГруппаОберткиПриложенийКатегории%1_%2", Цел(ИндексПриложения / 3), ИмяКатегории),
				Тип("ГруппаФормы"), ГруппаКатегорииИПриложений);
				ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаОберткиПриложенийКатегории);
				ГруппаОберткиПриложенийКатегории.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				
			КонецЕсли;
			
			ДанныеПриложения = НовыеДанныеПриложенияДляОтображенияНаФорме();
			ЗаполнитьЗначенияСвойств(ДанныеПриложения, Приложение);
			ДанныеПриложения.Вставить("Индекс", Приложения.Индекс(Приложение));
			
			СоздатьЭлементыПриложенияНаФорме(ДанныеПриложения, ГруппаОберткиПриложенийКатегории, ПараметрыСозданияПриложения);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НовыеДанныеПриложенияДляОтображенияНаФорме()
	
	Возврат Новый Структура("Имя,Картинка,Синоним,Описание,Индекс");
	
КонецФункции

&НаСервере
Процедура СоздатьЭлементыПриложенияНаФорме(ДанныеПриложения, РодительскаяГруппа, ПараметрыСоздания)
	
	Имя = ДанныеПриложения.Имя;
	
	ГруппаПриложения = Элементы.Добавить(
	СтрШаблон("ГруппаПриложения_%1", Имя), Тип("ГруппаФормы"), РодительскаяГруппа);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаПриложения);
	ГруппаПриложения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПриложения.Высота = ПараметрыСоздания.Высота;
	ГруппаПриложения.РастягиватьПоГоризонтали = Ложь;
	
	СоздатьГраницуПриложенияСверхуИлиСнизу(
	"Верх",
	Имя,
	ГруппаПриложения,
	ПараметрыСоздания.КартинкаЛевыйВерхнийУгол,
	ПараметрыСоздания.КартинкаЛинияВерх,
	ПараметрыСоздания.КартинкаПравыйВерхнийУгол);
	
	ГруппаОберткаДляВертикальныхЛиний = Элементы.Добавить(
	СтрШаблон("ГруппаОберткаДляВертикальныхЛиний_%1", Имя), Тип("ГруппаФормы"), ГруппаПриложения);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаОберткаДляВертикальныхЛиний);
	ГруппаОберткаДляВертикальныхЛиний.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаОберткаДляВертикальныхЛиний.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Полуторный;
	
	ДекорацияЛинияЛево = Элементы.Добавить(
	СтрШаблон("ДекорацияЛинияЛево_%1", Имя), Тип("ДекорацияФормы"), ГруппаОберткаДляВертикальныхЛиний);
	ДекорацияЛинияЛево.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияЛинияЛево.Картинка = ПараметрыСоздания.КартинкаЛинияЛево;
	ДекорацияЛинияЛево.РастягиватьПоВертикали = Истина;
	ДекорацияЛинияЛево.РазмерКартинки = РазмерКартинки.Растянуть;
	
	ГруппаКонтент = Элементы.Добавить(
	СтрШаблон("ГруппаКонтент_%1", Имя), Тип("ГруппаФормы"), ГруппаОберткаДляВертикальныхЛиний);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаКонтент);
	ГруппаКонтент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКонтент.Ширина = ПараметрыСоздания.ШиринаКонтента;
	
	ДекорацияОтступСверху = Элементы.Добавить(
	СтрШаблон("ДекорацияОтступСверху_%1", Имя), Тип("ДекорацияФормы"), ГруппаКонтент);
	ДекорацияОтступСверху.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияОтступСверху.Шрифт = ПараметрыСоздания.ШрифтМаленькойДекорации;
	ДекорацияОтступСверху.Высота = 3;
	
	
	СоздатьЭлементыДанныхПриложенияНаФорме(ГруппаКонтент, ДанныеПриложения, ПараметрыСоздания);
	
	
	ДекорацияЛинияПраво = Элементы.Добавить(
	СтрШаблон("ДекорацияЛинияПраво_%1", Имя), Тип("ДекорацияФормы"), ГруппаОберткаДляВертикальныхЛиний);
	ДекорацияЛинияПраво.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияЛинияПраво.Картинка = ПараметрыСоздания.КартинкаЛинияПраво;
	ДекорацияЛинияПраво.РастягиватьПоВертикали = Истина;
	ДекорацияЛинияПраво.РазмерКартинки = РазмерКартинки.Растянуть;
	
	СоздатьГраницуПриложенияСверхуИлиСнизу(
	"Низ",
	Имя,
	ГруппаПриложения,
	ПараметрыСоздания.КартинкаЛевыйНижнийУгол,
	ПараметрыСоздания.КартинкаЛинияНиз,
	ПараметрыСоздания.КартинкаПравыйНижнийУгол);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьГраницуПриложенияСверхуИлиСнизу(
	Направление,
	НазваниеПриложения,
	РодительскаяГруппа,
	КартинкаЛевыйУгол,
	КартинкаЛиния,
	КартинкаПравыйУгол)
	
	ГруппаЛинии = Элементы.Добавить(
	СтрШаблон("ГруппаЛинии%1_%2", Направление, НазваниеПриложения), Тип("ГруппаФормы"), РодительскаяГруппа);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаЛинии);
	ГруппаЛинии.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаЛинии.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	
	ДекорацияЛевыйУгол = Элементы.Добавить(
	СтрШаблон("ДекорацияЛевыйУгол%1_%2", Направление, НазваниеПриложения), Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияЛевыйУгол.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияЛевыйУгол.Картинка = КартинкаЛевыйУгол;
	
	ДекорацияЛиния = Элементы.Добавить(
	СтрШаблон("ДекорацияЛиния%1_%2", Направление, НазваниеПриложения), Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияЛиния.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияЛиния.Картинка = КартинкаЛиния;
	ДекорацияЛиния.РастягиватьПоГоризонтали = Истина;
	ДекорацияЛиния.РазмерКартинки = РазмерКартинки.Растянуть;
	
	ДекорацияПравыйУгол = Элементы.Добавить(
	СтрШаблон("ДекорацияПравыйУгол%1_%2", Направление, НазваниеПриложения), Тип("ДекорацияФормы"), ГруппаЛинии);
	ДекорацияПравыйУгол.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияПравыйУгол.Картинка = КартинкаПравыйУгол;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДанныхПриложенияНаФорме(ГруппаКонтент, ДанныеПриложения, ПараметрыСоздания)
	
	Имя = ДанныеПриложения.Имя;
	
	ГруппаДанные = Элементы.Добавить(
	СтрШаблон("ГруппаДанные_%1", Имя), Тип("ГруппаФормы"), ГруппаКонтент);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаДанные);
	ГруппаДанные.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаДанные.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	
	ГруппаШапкаПриложения = Элементы.Добавить(
	СтрШаблон("ГруппаШапкаПриложения_%1", Имя), Тип("ГруппаФормы"), ГруппаДанные);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаШапкаПриложения);
	ГруппаШапкаПриложения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаШапкаПриложения.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ГруппаШапкаПриложения.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	ДекорацияКартинкаПриложения = Элементы.Добавить(
	НаименованиеДекорацииКартинкиПриложения(Имя), Тип("ДекорацияФормы"), ГруппаШапкаПриложения);
	ДекорацияКартинкаПриложения.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияКартинкаПриложения.Картинка = ДанныеПриложения.Картинка;
	ДекорацияКартинкаПриложения.Ширина = 5;
	ДекорацияКартинкаПриложения.Высота = 2;
	ДекорацияКартинкаПриложения.РазмерКартинки = РазмерКартинки.Пропорционально;
	ДекорацияКартинкаПриложения.Гиперссылка = Истина;
	ДекорацияКартинкаПриложения.УстановитьДействие("Нажатие", "Подключаемый_ДекорацияКартинкаПриложенияНажатие");
	
	ДекорацияНазваниеПриложения = Элементы.Добавить(
	НаименованиеДекорацииНазванияПриложения(Имя), Тип("ДекорацияФормы"), ГруппаШапкаПриложения);
	ДекорацияНазваниеПриложения.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияНазваниеПриложения.Заголовок = ДанныеПриложения.Синоним;
	ДекорацияНазваниеПриложения.Шрифт = ПараметрыСоздания.ШрифтНазвания;
	ДекорацияНазваниеПриложения.Ширина = ПараметрыСоздания.ШиринаНазвания;
	
	ПолеВыбораПриложения = Элементы.Добавить(
	НаименованиеПоляВыбораПриложения(Имя), Тип("ПолеФормы"), ГруппаШапкаПриложения);
	ПолеВыбораПриложения.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВыбораПриложения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеВыбораПриложения.ПутьКДанным = СтрШаблон("Приложения[%1].Выбрано", ДанныеПриложения.Индекс);
	ПолеВыбораПриложения.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	ПолеВыбораПриложения.УстановитьДействие("ПриИзменении", "Подключаемый_ПолеВыбораПриложенияПриИзменении");
	
	ДекорацияОписаниеПриложения = Элементы.Добавить(
	НаименованиеДекорацииОписанияПриложения(Имя), Тип("ДекорацияФормы"), ГруппаДанные);
	ДекорацияОписаниеПриложения.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияОписаниеПриложения.Заголовок = ДанныеПриложения.Описание;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяПриложенияПоНазваниюЭлемента(НазваниеЭлемента)
	
	ПозицияПодчеркивания = СтрНайти(НазваниеЭлемента, "_");
	Если ПозицияПодчеркивания = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Сред(НазваниеЭлемента, ПозицияПодчеркивания + 1);
	
КонецФункции

&НаСервере
Процедура УдалитьВыбранноеПриложениеСФормы(ДанныеПриложения)
	
	ЭлементПриложенияНаФорме = Неопределено;
	
	Для Каждого Элемент Из Элементы.ВыбранныеПриложенияКонтейнер.ПодчиненныеЭлементы Цикл
		Если СтрНайти(Элемент.Имя, ДанныеПриложения.Имя) Тогда
			ЭлементПриложенияНаФорме = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементПриложенияНаФорме = Неопределено Тогда
		Для Каждого Элемент Из Элементы.АВПКонтейнер.ПодчиненныеЭлементы Цикл
			Если СтрНайти(Элемент.Имя, ДанныеПриложения.Имя) Тогда
				ЭлементПриложенияНаФорме = Элемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭлементПриложенияНаФорме = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Удалить(ЭлементПриложенияНаФорме);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВыбранноеПриложениеНаФорму(ДанныеПриложения, ВыбраноПодчиненноеПриложение)
	
	Имя = ДанныеПриложения.Имя;
	ЭлементГруппы = Элементы.Найти(НаименованиеГруппыВыбранногоПриложения(Имя));
	
	Если ЭлементГруппы <> Неопределено Тогда
		
		Если ЭлементГруппы.Родитель = Элементы.ВыбранныеПриложенияКонтейнер И ВыбраноПодчиненноеПриложение Тогда
			Элементы.Переместить(ЭлементГруппы, Элементы.АВПКонтейнер);
		ИначеЕсли ЭлементГруппы.Родитель = Элементы.АВПКонтейнер И Не ВыбраноПодчиненноеПриложение Тогда
			Элементы.Переместить(ЭлементГруппы, Элементы.ВыбранныеПриложенияКонтейнер);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если ВыбраноПодчиненноеПриложение Тогда
		ГруппаКонтейнер = Элементы.АВПКонтейнер;
	Иначе
		ГруппаКонтейнер = Элементы.ВыбранныеПриложенияКонтейнер;
	КонецЕсли;
	
	ДобавитьЭлементыВыбранногоПриложения(ДанныеПриложения, ГруппаКонтейнер);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыВыбранногоПриложения(ДанныеПриложения, ГруппаКонтейнер)
	
	Имя = ДанныеПриложения.Имя;
	
	ГруппаВыбранногоПриложения = Элементы.Добавить(
	НаименованиеГруппыВыбранногоПриложения(Имя), Тип("ГруппаФормы"), ГруппаКонтейнер);
	ЗаполнитьОбычнуюГруппуБезЗаголовка(ГруппаВыбранногоПриложения);
	ГруппаВыбранногоПриложения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВыбранногоПриложения.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	ГруппаВыбранногоПриложения.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	ВыбранноеПриложениеОтступ = Элементы.Добавить(
	СтрШаблон("ВыбранноеПриложениеОтступ_%1", Имя), Тип("ДекорацияФормы"), ГруппаВыбранногоПриложения);
	ВыбранноеПриложениеОтступ.Вид = ВидДекорацииФормы.Надпись;
	ВыбранноеПриложениеОтступ.Шрифт = Новый Шрифт(, 1);
	
	ДекорацияКартинка = Элементы.Добавить(
	СтрШаблон("ВыбранноеПриложениеКартинка_%1", Имя), Тип("ДекорацияФормы"), ГруппаВыбранногоПриложения);
	ДекорацияКартинка.Вид = ВидДекорацииФормы.Картинка;
	ДекорацияКартинка.Картинка = ДанныеПриложения.Картинка;
	ДекорацияКартинка.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
	ДекорацияКартинка.Шрифт = Новый Шрифт(, 18);
	
	ДекорацияНазвание = Элементы.Добавить(
	СтрШаблон("ВыбранноеПриложениеНазвание_%1", Имя), Тип("ДекорацияФормы"), ГруппаВыбранногоПриложения);
	ДекорацияНазвание.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияНазвание.Заголовок = ДанныеПриложения.Синоним;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбычнуюГруппуБезЗаголовка(Группа)
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
КонецПроцедуры

#КонецОбласти

#Область ВыборПриложений

&НаКлиенте
Процедура ВыбратьПриложение(ВыборУжеИзменен)
	
	Если ТипЗнч(ТекущийЭлемент) <> Тип("ПолеФормы") И ТипЗнч(ТекущийЭлемент) <> Тип("ДекорацияФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПриложения = ИмяПриложенияПоНазваниюЭлемента(ТекущийЭлемент.Имя);
	Если ИмяПриложения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьПриложениеНаСервере(ИмяПриложения, ВыборУжеИзменен);
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьПриложениеНаСервере(Знач ИмяПриложения, Знач ВыборУжеИзменен)
	
	Отбор = Новый Структура("Имя", ИмяПриложения);
	СтрокиТЗ = Приложения.НайтиСтроки(Отбор);
	Если СтрокиТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Приложение = СтрокиТЗ[0];
	
	Если Не ВыборУжеИзменен Тогда
		Приложение.Выбрано = Не Приложение.Выбрано;
	КонецЕсли;
	Если Не Приложение.ВыбранностьИзменена Тогда
		Приложение.ВыбранностьИзменена = Истина;
	КонецЕсли;
	
	Приложение.ВыбраноВручную = Приложение.Выбрано;
	
	УстановитьВыбранностьПриложенийПриВыбореПриложения(Приложение);
	ОбновитьОтображениеВыбранныхПриложений();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВыбранностьПриложенийПриВыбореПриложения(Приложение, ОписаниеПриложений = Неопределено)
	
	Если ОписаниеПриложений = Неопределено Тогда
		ОписаниеПриложений = ОписаниеВсехБизнесПриложений();
	КонецЕсли;
	
	ПодчиненныеПриложения = ПодчиненныеПриложения(Приложение.Имя, ОписаниеПриложений);
	Для Каждого ПодчиненноеПриложение Из ПодчиненныеПриложения Цикл
		
		Если ПодчиненноеПриложение.ВыбраноВручную Тогда
			Продолжить;
		КонецЕсли;
		
		ДругоеРодительскоеПриложениеВыбрано = ДругоеРодительскоеПриложениеВыбрано(
		ПодчиненноеПриложение, Приложение, ОписаниеПриложений);
		
		Если Не ДругоеРодительскоеПриложениеВыбрано Тогда
			ПодчиненноеПриложение.Выбрано = Приложение.Выбрано;
			УстановитьВыбранностьПриложенийПриВыбореПриложения(ПодчиненноеПриложение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПродолжениеРаботы

&НаКлиенте
Асинх Процедура ЗавершитьРаботуНаФорме()
	
	Если ЕстьОткрытыеОкна() Тогда
		
		ОтветПользователя = Ждать ВопросАсинх(
		НСтр("ru = 'Для подключения приложений будут закрыты все открытые формы. Продолжить?'"),
		РежимДиалогаВопрос.ОКОтмена);
		
		Если ОтветПользователя <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗавершитьРаботуНаФормеНаСервере();
	ОбновитьИнтерфейс();
	ЗакрытьВсеОкна();
	
	ПоказатьОповещениеПользователя(
	НСтр("ru = 'Демо'"), , НСтр("ru = 'Приложения успешно подключены'"),
	БиблиотекаКартинок.РазделДемо);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьОткрытыеОкна()
	
	Окна = ПолучитьОкна();
	Для Каждого ОкноПриложения Из Окна Цикл
		Форма = ОкноПриложения.ПолучитьСодержимое();
		Если Форма <> Неопределено И Форма <> ЭтотОбъект Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьВсеОкна()
	
	Окна = ПолучитьОкна();
	Для Каждого ОкноПриложения Из Окна Цикл
		Форма = ОкноПриложения.ПолучитьСодержимое();
		Если Форма <> Неопределено Тогда
			Форма.Модифицированность = Ложь;
			Форма.Закрыть();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьРаботуНаФормеНаСервере()
	
	ИменаПриложений = Новый Массив;
	Для Каждого Приложение Из Приложения Цикл
		
		Если Не Приложение.ВыбранностьИзменена Тогда
			Продолжить;
		КонецЕсли;
		
		ИменаПриложений.Добавить(Приложение.Имя);
		
		Если Приложение.Выбрано Тогда
			РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(
			Приложение.Имя, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление);
		Иначе
			РегистрыСведений.ПодключениеКомбинированныхПриложений.ЗарегистрироватьСобытие(
			Приложение.Имя, Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоУдаление);
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеВсехПриложений = ОписаниеВсехБизнесПриложений();
	СтатусыПриложений = РегистрыСведений.ПодключениеКомбинированныхПриложений.СтатусПриложений(ИменаПриложений);
	
	Для каждого ДанныеСтатуса Из СтатусыПриложений Цикл
		
		СтатусПриложения = ДанныеСтатуса.Статус;
		ОписаниеПриложения = ОписаниеПриложенияПоИмени(ДанныеСтатуса.ИмяПриложения, ОписаниеВсехПриложений);
		
		Если СтатусПриложения <> Перечисления.СтатусКомбинированногоПриложения.Отключено
			И СтатусПриложения <> Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление Тогда
			
			ОписаниеСобытия = НСтр("ru='Пользователь инициировал отключение приложения ""%1"".'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			ТарификацияБизнес.ОбработатьОтключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
			
		ИначеЕсли СтатусПриложения = Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление Тогда
			
			ОписаниеСобытия = НСтр("ru='Пользователь инициировал подключение приложения ""%1"".'");
			ОписаниеСобытия = СтрШаблон(ОписаниеСобытия, ОписаниеПриложения.Имя);
			ТарификацияБизнес.ОбработатьПодключениеПриложения(ОписаниеПриложения, ОписаниеСобытия, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
	РабочийСтолУНФ.УстановитьНачальнуюСтраницуИИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПростыеРеквизиты()
	
	ЦветАктивности = Новый Цвет(255, 232, 179);
	ЦветНеактивности = ЦветаСтиля.ЦветФонаФормы;
	
КонецПроцедуры

#КонецОбласти
